app/views/welcome/index.html.erb

SELECT "sizes".* FROM "sizes"  WHERE "sizes"."style_id" = $1 AND (stock > 0)  [["style_id", 1]]
---
              <select id="<%= style.short_name %>-size" class="size">
                <% style.sizes.in_stock.each do |size| %>

SELECT "colors".* FROM "colors"
---

    $('.colors-arrow-right').click(function() {
      scrollWidth = 3*$('#colors-wrapper ul li').first().width();
      $('#colors-swatches').animate( { scrollLeft: '+=' + scrollWidth}, 400);
    });