app/controllers/welcome_controller.rb

  def index
    @styles = Style.all
    @colors = Color.all
---
SELECT "styles".* FROM "styles"
SELECT "colors".* FROM "colors"